{
    "crime": "You sit in a booth at a dimly lit diner, the smell of coffee thick in the air. The clock ticks toward midnight. Tonight is the night you've been planning for months: stealing a priceless painting from the mansion of a notorious art collector. The plan is in your hands. You're weighing your options as the diner hums with low chatter. You could create a distraction—a car accident, maybe that would draw the guards outside and leave the mansion vulnerable. Or, you could slip in through the back, using the cover of darkness for a quiet entry. You glance at your watch. Time's running out. What's your move?",
    "sci-fi": "You stand at the airlock of the Federation's space station, the cold metal walls humming with energy. The mission is simple: infiltrate, steal the classified tech, and get out before anyone notices. But nothing ever goes as planned. In front of you, two choices hover. You could use the experimental cloaking device strapped to your wrist, sneaking in unnoticed through a series of ventilation shafts. Or, you could trigger an electrical pulse, temporarily disabling their systems and buying yourself a few minutes to rush in. The lights above flicker—your window of opportunity is closing. What's your move?",
    "fantasy": "The enchanted forest stretches endlessly before you, the path ahead dark and full of dangers. Deep within the woods lies the **Amulet of Asha**, a relic powerful enough to save your kingdom. The night is still, except for the distant howling of wolves. As you approach the entrance to the ancient cave where the amulet is hidden, you consider your options. You could charge in, sword drawn, ready to face any monster guarding the relic. Or, you could take the longer, quieter path around, avoiding direct confrontation and relying on wit. The moon is rising, and time is running out. What will you do?",
    "mystery": "The rain taps steadily against your umbrella as you stand outside the old manor. Inside lies the last known location of the missing billionaire. The case has been cold for weeks, but tonight, you might get your break. You scan the front of the manor, considering your next move. You could knock on the door, announce yourself, and demand answers from whoever's inside. Or, you could find another way in—through the side window that's been left slightly ajar. A faint light flickers in one of the upper windows. What will you do?"
}   
